//null
//null

//[]
//0

//["a","a","b","b","c","c","c"]
//6, a2b2c3

//["a", "b", "a", "c", "b"]
//10, a1b1a1c1b1

//["a","b","b","b","b","b","b","b","b","b","b","b","b"]
//4, a1b12

//[1,2,3,3,3,0]
//8, 11213301

//сложность по скорости - O(N) - так как нужно пройти по каждому элементу минимум 1 раз
//сложность по памяти - O(1) - не используем доп память фактически

class Solution {
    public int compress(char[] chars) {
        //будем идти циклом по массиву и в момент смены последовательности сбрасывать счетчик в результирующую строку
        //посчитаем длину результирующей строки и выведем
    }
}